src/Catalogs/рмкИсходящиеСообщения/рмкИсходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рмкИсходящиеСообщения</name>
  <attributes>
    <name>ТекущийСтатус</name>
    <type>
      <types>EnumRef.рмкСтатусыСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>CatalogRef.рмкСерверы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаПодключения</name>
    <type>
      <types>CatalogRef.рмкТочкиПодключения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВиртуальныйХост</name>
    <type>
      <types>CatalogRef.рмкВиртуальныеХосты</types>
    </type>
  </attributes>
  <attributes>
    <name>УниверсальнаяДатаСоздания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/рмкИсходящиеСообщения/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокРеквизитов = "ТочкаПодключения,Код,ДатаСоздания";
	РеквизитыСообщения = рмкОбщегоНазначенияПереопределяемый.ЗначенияРеквизитовОбъекта(Данные.Ссылка, СписокРеквизитов);
	ИмяТочки = рмкОбщегоНазначенияПереопределяемый.ЗначениеРеквизитаОбъекта(РеквизитыСообщения.ТочкаПодключения, "ИмяТочки");
	Представление = СтрШаблон("%1 %2 %3", ИмяТочки, РеквизитыСообщения.ДатаСоздания, РеквизитыСообщения.Код);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
